/*
     题目：键盘录入字符串，并遍历
*/

#include<stdio.h>
int main()
{
    //1.键盘录入字符串
    //使用第一种方式记录字符串：录入相当于修改字符串，所以用 字符数组+双引号
    char str[100];

    printf("请录入一个字符串：\n");
    scanf("%s", str);

    printf("你录入的的字符串是：%s\n", str);

    //2.遍历字符串
    char* p = str;//用指针存储字符串地址

    while (1)
    {
        //利用指针解引用获得具体字符数据，赋值给c
        char c = *p;

        //判断当前字符是否为结束标记‘0’
        if (c == '\0')
        {
            //是‘0’则结束循环
            break;
        }

        //输出当前指针p解引用获取到的字符%c
        printf("%c\n", c);

        //指针向后移动一位
        p++;


    }


    return 0;
}