/*
     题目：定义一个数组，存储5个学生名字并遍历

     字符串底层就是字符数组
     把多个字符数组存入一个大数组
     
     二维数组：二维数组的每一个索引是一维数组整体，需要用指针存储地址
*/

#include<stdio.h>
int main()
{
    //第一种方式：二维数组
    //1.定义二维数组
    char strarr[5][100] =
    {
        "wzl",
        "zhf",
        "kjx",
        "xly",
        "ljy"
    };

    //2.遍历二维数组
    for (int i = 0;i < 5;i++)
    {
        // i:表示二维数组的索引，把每一个一维数组的地址循环赋值给指针p1
        char* p1 = strarr[i];
        printf("%s\n", p1);
    }



    printf("\n第二种方式：\n");



    //第二种方式：指针数组  指针方式定义数组
    //指针数组：把五个字符串的指针，放到一个数组中
    
    //数组里每一个元素都是 char* 类型指针，存放的是数组内部的字符串地址
    // [5]代表包含5个这样的字符地址
    char* strarr2[5] =
    {
        "wzl",
        "zhf",
        "kjx",
        "xly",
        "ljy"
    };

    //遍历指针数组
    for (int i = 0; i < 5; i++)
    {
        char* p2 = strarr[i];//取出 strarr2 中每个索引 i 的地址，赋值给新的指针 p2
        printf("%s\n", p2);  //根据每个 i 的地址，打印字符串内容
    }

    return 0;
}