/*
     两种定义字符串的方式
*/

#include<stdio.h>
int main()
{
    //1.底层逻辑
    char str1[] = { 'a','b','c','\0' };    //手动初始化，以\0结尾
    printf("%s\n", str1);


    //2.定义方式一 ： 字符数组加双引号
    char str2[] = "abc";       

    /*
          细节：实际存储时是按照底层逻辑
                数组长度要预留结束标记空间  
                字符数组+双引号方式， 定义的字符串里面内容可以改变
    */
    str2[0] = 'd';
    printf("%s\n", str2);


     //3.定义方式二：利用指针 ＋ 双引号 定义 字符串
    char* str3 = "abc";
    char* str4 = "abc";
    printf("%s\n", str3);

    /*
         细节：实际存储按照底层逻辑
               指针+双引号定义的字符串，字符数组会放在只读常量区

         只读常量区特点：
                  内容不可修改
                  定义的字符串内容可以复用（地址不变）
                            创建新的字符数组时，先检查只读常量区有没有已经存在的，没有创建新的，有就复用
    */

    //str3[0]="6";    错误，不能修改 
    printf("str3地址：%p\n", str3);
    printf("str4复用的地址：%p\n", str4);


    return 0;
}