//请编写程序，输入等腰三角形的高度，输出由星号组成的等腰三角形。
//
//输入格式
//高度(正整数)
//
//输出格式
//星号组成的等腰三角形(参见输出样例)
//
//输入样例
//5
//
//输出样例
//   *
//   **
//   ***
//   ****
//   *****
//
//注：星号与星号之间空一格，行末没有多余的空格。

#include<stdio.h>
int main()
{
	//1.输入高度
	int high;
	scanf("%d", &high);

	//2.利用循环,打印上半部分
	for (int i = 1; i <= high; i++)//打印行数
	{
		for (int j = 1; j <= high - i; j++)//一次外循环，内循环打印 high - i 次空格，打印出这一次外循环（第i排）星星前面的空格
		{
			printf(" ");
		}

		for (int k = 1; k <= i; k++)//打印出当前第 i 排的星星*，有i个，每一次外循环一次，k打印从 1 到 i 个*，紧贴空格后面
		{
			if (k == i)//判断 k=i 时，打印*到了这一排最后一个，不用在后面打印空格
			{
				printf("*");
			}
			else//如果没到最后一个，就在* 后面加一个空格
			{
				printf("* ");
			}
		}

		printf("\n");//每行结束换行，进入下一次循环
	}



	//3.打印下半部分
	for (int i = 1; i <= high-1; i++)//打印行数，只有四行（去掉中间重复一行）
	{
		for (int j = 1; j <= i ; j++)//打印空格
		{
			printf(" ");
		}

		for (int k = 1; k <= high-i; k++)//打印星星，有 1 到 high-i 个
		{
			if (k == high-i)
			{
				printf("*");
			}
			else
			{
				printf("* ");
			}
		}

		printf("\n");
	}
	return 0;
}