//给定N个正整数，请统计奇数和偶数各有多少个？
//
//   输入格式：
//   输入第一行给出一个正整N（≤1000）；第2行给出N个非负整数，以空格分隔。
//
//   输出格式：
//   在一行中先后输出奇数的个数、偶数的个数。中间以1个空格分隔。
//
//   输入样例：
//   9
//   88 74 101 26 15 0 34 22 77
//   输出样例：
//   3 6

#include<stdio.h>
int main()
{
	//1.定义N个整数
	int N;
	scanf("%d", &N);

	//2.初始化奇数和偶数
	int odd = 0;
	int even = 0;
	int num;

	for (int i = 0; i < N; i++)
	{
		//输入一个数字，就判断输入的是奇数还是偶数，增加次数
		scanf("%d", &num);
		if (num % 2 == 0)
		{
			even++;
		}
		else
		{
			odd++;
		}
	}
	printf("%d %d", odd, even);//打印次数
	return 0;
}