/*
   读取文件步骤：
             1.打开文件 ：fopen（）返回类型 FILE* ，要用指针类型接收

             2.读取数据 ：fgetc（接收指针的名字）  一次读一个字符，读不到返回-1
                          fgets（）                一次读一行（字符串），读不到返回null
                          fread（）                一次读多个

             3.关闭文件 ：fclose

         例： "C:\Users\liujiayi\Desktop\file.txt.txt"
*/

#include<stdio.h>
int main()
{
    //1.打开文件

    FILE* f3 = fopen("C:\\Users\\liujiayi\\Desktop\\file.txt", "r");

    //2.使用fread读取有效字节数
    /*
         细节：
             读取的时候，每次尽可能把数组装满，返回的是读取到的有效字节数（int型）
             因此fread的格式得用整型接收

             先定义数组作为指针 char arr[100];
             int n = fread(指向数组的指针arr，单个数据单元字节数1，读取的长度100，文件指针f3)
        
             例：文件有100个字节
                 数组长度：40
                 第一次：读取前40个，把数组装满，函数返回40
                 第二次：读取后40个，把数组装满，函数返回40
                 第三次：读取剩余20个，把数据放在数组，返回20
                 第四次：读取0个，返回0

                 因此当返回值不为0时，就可以一直读取 文件中字节 保存在 数组中 的字节数
    */

    char arr[100];//定义数组接收文件内容
    int n;//定义整数接收返回的文件字节数

    //fread会把字节逐个读取再返回，返回0时读取完
    while ((n=fread(arr,1,100,f3))!=0)//读不到内容 返回0，则利用循环，若读不到0就一直读
    {
        for (int i = 0; i < n; i++)/*           n：字节数
                                      内循环表示：从第一个字符（存入数组是arr[0]）开始
                                                  逐个打印每一个读取完返回的字节，对应的字符     
                                   */
        {
            printf("%c", arr[i]);//逐个打印第i个字符
        }
    }

    //3.关闭文件
    fclose(f3);

    return 0;
}