/*
      1.绝对路径：
             以盘符开始，C:\aaa\a.txt
      
      2.相对路径：
             参照物：当前项目
             不以盘符开始，aaa\a.txt
      

      3.路径以字符串形式表示

      \：转义字符

      需求一：打印一个双引号
      ”   ：表示字符串开头或结尾
       要打印一个普普通通的双引号
       在前面加\
       \：表示改变\后面符号原本的含义，变成普通的字符


       需求二：打印一个\
       使用：\\把第二个\的含义转变

*/

#include<stdio.h>
int main()
{
    //1.定义字符串表示文件路径
    char* file = "C:\\aaa\\a.txt"; //原文件名：C:\aaa\a.txt，第一个\是转义字符，使用转义字符将原本的\变成普通含义


    //2.打印
    printf("%s\n", file);

    return 0;
}