/*
      二维数组：
             定义格式和遍历方式

             定义格式1：
                   m：表示二维数组的长度（里面有几个一维数组）
                   n：表示每一个一维数组的长度
                   数据类型 arr[m][n]=
                   {
                        {1,2,3,4,5...},
                        {1,2,3,4,5...},
                        {1,2,3,4,5...}
                   };
                 
      
      遍历：利用索引 / 利用指针进行遍历
*/

#include<stdio.h>
int main()
{
    //1.定义二维数组
    int arr[3][5] =
    {
        {1,2,3,4,5},
        {11,22,33,44,55},
        {111,222,333,444,555}
    };

    //2.利用索引遍历
    //  arr[0]表示二维数组中的第一个一维数组{1，2，3，4，5}
    //  arr[0][1]表示 ：第一个一维数组中的第二个元素

    for (int i = 0; i < 3; i++)
    {
        // i:依次表示二维数组中的索引

        //双层循环，打印出 一维数组的每一个元素
        for (int j = 0; j < 5; j++)
        {
            // j：依次表示一维数组中的索引
            //内循环：遍历每一个一维数组

            printf("%d ", arr[i][j]);

        }

        //内循环结束一次，表示一维数组遍历完毕
        printf("\n");
    }
    
    return 0;
}