/*
     二级指针：
            格式：数据类型** 指针名
            （int*）* p
            二级指针可以操作一级指针记录的地址
*/

#include<stdio.h>
int main()
{
    //1.定义变量
    int a = 10;    //第一个地址
    int b = 20;

    //2.定义一级指针
    int* p = &a;    //第二个地址，包含第一个地址
    int* p1 = &a;
    //3.定义二级指针
    int** pp = &p;     //第三个地址，包含前两个地址

    //作用1：利用二级指针修改一级指针里面记录的内存地址
    *pp = &b;        //解引用第三个地址，变成第二个地址，第二个地址赋值成b的地址


    //作用2：利用二级指针获取变量中的数据

    //输出打印
    printf("a的地址：%p\n", &a);
    printf("b的地址：%p\n", &b);
    printf("未修改的p1的地址（一级指针自己的内存地址，地址里面的是a的内存地址）：%p\n",p1);
    printf("解引用p1的值：%d\n", *p1);
    printf("解引用修改后p的值：%d\n", *p);
    printf("修改后p存储的地址（&b）：%p\n", p); 
    printf("解引用一次的pp（&b）的地址：%p\n", *pp);
    printf("p本身的内存地址：%p\n", &p);
    printf("pp存储的p本身的内存地址：%p\n", pp);
    printf("pp的地址（**pp自己的内存地址）：%p\n", &pp);
    printf("解引用两次的pp的值：%d\n", **pp);

    return 0;
}
