/*
     二维数组：
           利用指针遍历二维数组
*/

#include<stdio.h>
int main()
{
    //1.定义二维数组
    int arr[2][5] =
    {
        {1,2,3,4,5},
        { 11, 22, 33, 44, 55 }
    };

    //2.利用指针遍历数组
    //获取二维数组指针
    /*
        定义数组指针 p，类型是 int（*）[5]
        指向包含5个int型的一维数组，刚好匹配二维数组的每行结构
        
        arr是数组名，此时代表第0行的地址，赋值给p
    */

    //数组指针：把二维数组里面的某一个一维数组的整体地址存储到指针 p 中，但是指向的是首地址
    int(*p1)[5] = arr;
    int(*p2)[5] = &arr[0];//取一整个第一个一维数组的地址给p2
    int(*p3)[5] = &arr[1];//取一整个第二个一维数组的地址给p3
    int(*p4)[5] = arr+1;  //整个第一个一维数组+1
    printf("p1指向的是整个第一个一维数组的首地址：%p\n", p1);
    printf("*p1是把p1（整个第一个一维数组的地址指针解引用）得到行首的元素的地址&arr[0][0]：%p\n", *p1);
    printf("p2指向的也是首地址：%p\n\n", p2);

    printf("p3指向的是整个第二个一维数组的地址：%p\n", p3);
    printf("*p3是把p3（整个第二个一维数组的地址指针解引用）得到行首的元素的地址&arr[1][0]：%p\n", *p3);
    printf("p4是 arr+1 后的地址（整个第一个一维数组往后一位）：%p\n\n", p4);


    //如果访问某一具体元素，需要先把数组指针解引用，再加下标：（*p1)[1],或者是：arr[0][0]
    printf("p1第一个一维数组的第一个数据：%d\n", (*p1)[0]);
    printf("p1第一个一维数组的第一个数据：%d\n", arr[0][0]);
    printf("p2第一个一维数组的第一个数据：%d\n", (*p2)[0]);
    printf("p3第二个一维数组的第一个数据：%d\n", (*p3)[0]);
    printf("p4第二个一维数组的第一个数据：%d\n\n", (*p4)[0]);


    //利用循环嵌套遍历二维数组
    /*
         外循环：控制遍历行数：2次
         p++：数组指针向后移动一整个一维数组，跳到下一个一维数组
    
         内循环：遍历当前行的每一个元素
         *p：对数组指针p解引用，得到行首元素地址
         *p+j：从行首地址，往后移动 j 个int长度（4个字节），得到下一个元素位置
         *（*p+j）：对得到的元素地址解引用，得到具体值，arr[i][j]
    */

    for (int i = 0; i < 2; i++)
    {
        for (int j = 0; j < 5; j++)
        {
            printf("%d ", *(*p1 + j));
        }

        printf("\n");
        //移动二维数组指针，到下一个一维数组
        p1++;
    }


    return 0;
}