/*
       指针有意义的运算：
                 指针和整数加减：每次移动步长
                 指针和指针加减：间隔步长
        
        指针无意义的运算：
                  指针进行乘除

*/

#include<stdio.h>
int main()
{
    //1.前提条件：保证内存空间是连续的
    //   数组
    int arr[] = { 1,2,3,4,5,10,7,8,9 };

    int* p1 = &arr[0];

    //通过内存地址获取数据
    printf("%d\n", *p1);
    printf("%d\n", *(p1 + 1));

    //获取5索引的内存地址
    int* p2 = &arr[5];

    //p1和p2间隔步长
    printf("%d\n", p2 - p1);//间隔元素个数
    printf("%p\n", p1);
    printf("%p\n", p2);

    return 0;
}