/*
     指针作用1：操作其他函数中的变量
     
     &a   a的内存地址，需要赋值给指针变量存储 
     int *p1 = &a 代表定义一个指针变量p1，存储变量a的地址
     *p1  访问p1地址里的值，就是变量a的值
      
      
      函数内局部变量的生命周期：函数结束后局部变量被回收，无法通过指针访问
      解决：函数中在变量前加static关键字，使其生命周期延长至程序结束
      示例：static int a = 10;  // 函数结束后a不会被销毁，可通过指针持续访问 
      
  
*/

#include<stdio.h>
void swap(int* p1, int* p2);
int main()
{
    /*
         定义两个变量，要求交换变量中记录的值
         注意：交换的代码写在新的函数swap中
    */

    //1.定义两个变量
    int a = 10;
    int b = 20;

    //2.调用函数
    printf("调用前：%d,%d", a, b);
    swap(&a, &b);//a和b的地址传给指针变量
    printf("调用后：%d,%d", a, b);

    return 0;
}

//  指针作为函数参数，实现交换两个变量的值
void swap(int *p1, int *p2)//使用指针变量存储a和b的地址
{
    //引入第三个变量交换
    int temp = *p1;//用*p1把a的值赋值出去
    *p1 = *p2;
    *p2 = temp;
}