/*
         一、指针变量定义格式
  格式：数据类型 * 变量名;
  说明：1. 数据类型需与指向变量的类型保持一致
       2. * 是指针的标记，变量名由程序员自定义

       示例：       int a = 10; int* p1 = &a;    // 整型指针指向整型变量a
               double b = 10; double* p2 = &b;   // 浮点型指针指向浮点型变量b
  

         二、指针的核心作用
  1. 查询数据：通过  *指针名  解引用，获取指向变量的值
     示例：printf("%d\n", *p);    // 输出指针p指向变量的数值

  2. 存储/修改数据：通过 *指针名 给指向变量赋值
     示例：*p = 200;           // 将200赋值给指针p指向的变量


	     三、指针使用细节
   1. 指针变量的名字遵循C语言标识符命名规则
   2. 指针的数据类型必须与指向变量的类型一致
   3. 指针占用内存大小：32位编译器占4字节，64位编译器占8字节（与指向类型无关）
   4. 禁止直接将数值赋值给指针变量（指针应存储变量地址，而非普通数值）

*/




#include<stdio.h>
int main()
{
	//利用指针获取变量中的数据 / 存储数据

	int a = 10;

	// 1.定义一个指针指向变量a

	int* p = &a;

	// 2.利用指针去获取变量中的数据

	printf("%d\n", *p);

	// 3.利用指针存储数据 / 修改数据

	*p = 200;

	// 4.输出打印

	printf("%d\n", *p);
	printf("%d\n", a);
	return 0;
}